app/Http/Controllers/Search/UserController.php

select `name`, `id` from `companies`
select `name`, `id` from `subadmin1`
select `name`, `id` from `subadmin2`
---
				$users->where('post_type_id','=',request()->get('employment_type'));
			}

			$companies = Company::pluck('name','id');
			$states = SubAdmin1::pluck('name','id');
			$districts = SubAdmin2::pluck('name','id');