app/Http/Controllers/Post/CreateController.php

select * from `companies` where `user_id` = '2' order by `id` desc limit 100
---

		if (auth()->check()) {
			// Get all the User's Companies
			$data['companies'] = Company::where('user_id', auth()->user()->id)->take(100)->orderByDesc('id')->get();