app/Http/Controllers/options/optionController.php

select * from `packages`
---
    public function index(){
        $packages = DB::table('packages')->get();