app/Http/Controllers/Account/EditController.php

select `user_id`, SUM(visits) as total_visits from `posts` where `country_code` = 'KE' and `user_id` = 2 group by `user_id` limit 1
select `name`, `id` from `companies` where `user_id` = 2
select `name`, `id` from `subadmin1`
select `name`, `id` from `subadmin2`
---
	public function index()
	{
		$data = [];

		$data['countries'] = CountryLocalizationHelper::transAll(CountryLocalization::getCountries());
		$data['genders'] = Gender::trans()->get();
		$data['userTypes'] = UserType::all();
		$data['postTypes'] = PostType::trans()->get();
		$data['gravatar'] = (!empty(auth()->user()->email)) ? Gravatar::fallback(url('images/user.jpg'))->get(auth()->user()->email) : null;

		// Mini Stats
		$data['countPostsVisits'] = DB::table('posts')
			->select('user_id', DB::raw('SUM(visits) as total_visits'))
			->where('country_code', config('country.code'))
			->where('user_id', auth()->user()->id)
			->groupBy('user_id')
			->first();
		$data['countPosts'] = Post::currentCountry()
			->where('user_id', auth()->user()->id)
			->count();
		$data['countFavoritePosts'] = SavedPost::whereHas('post', function ($query) {
			$query->currentCountry();
		})->where('user_id', auth()->user()->id)
			->count();

		$data['cities'] = City::pluck('name','id');
		$data['subcategory'] = Company::where('user_id', auth()->user()->id)->pluck('name','id');
		$data['categories'] = Category::pluck('name','id');

        // Get Statess Types
        $data['states'] = SubAdmin1::pluck('name','id');

        // Get districts Types
        $data['districts'] = SubAdmin2::pluck('name','id');